YasinSHV/MusicMaster-STM32/MusicMaster/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "dictionary.h"
#include "stm32f3xx_it.h"


/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define DEBOUNCE_DELAY 350
#define PASSWORD_LENGTH 4
//Use Define to set when the 7-segment is on or off
//(to support both:{common anode, common cathode)
#define DISPLAY_ON GPIO_PIN_RESET
#define DISPLAY_OFF GPIO_PIN_SET
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;

PCD_HandleTypeDef hpcd_USB_FS;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_USB_PCD_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
struct digit {
	int number;
	uint16_t pattern;
	uint16_t anti_pattern;
};
struct Dictionary *playlist = NULL;
extern const struct Tone *volatile melody_ptr;
extern volatile uint16_t melody_tone_count;

uint16_t led[4];

int carrier[] = { 0, 0, 0, 0 };

int number = 0;
int password[4] = {-1,-1,-1,-1};
int wrongPassCounter = 0;

char logCorrect[19] = "LOG(XXXX, CORRECT)\n";
char logFailed[18] = "LOG(XXXX, FAILED)\n";

int logStatus = 1;
int alertStatus = 1;

int displayed_number[4];

uint32_t previousMillis = 0;
uint32_t currentMillis = 0;
uint32_t prevTime = 0;
uint32_t coolDownTimer = 0;

int isCorrect = -1;
int nextTurn = 0;
int blink = 1;
int index = 0;

uint32_t prevEnterTime = 0;

uint32_t buzzerEnterTime = 0;

uint32_t s = 0, e = 0;

int LED = 0, counter = 0;

struct digit digits[10];

enum BuzzerFlag {
	CorrectInput, WrongInput, CorrectPass, WrongPass, SuperWrongPass, NONE
};
enum BuzzerFlag buzzer_flag = NONE;

enum ProgramState{Paused, Resume, IDLE};
enum ProgramState programState = IDLE;
uint32_t buzzerCoolDown = 0;
//PWM BEGIN
//TIM_HandleTypeDef *pwm_timer = &htim2;
//uint32_t pwm_channel = TIM_CHANNEL_1;
//uint16_t _volume = 10;
//
////void PWM_Start() {
////	HAL_TIM_PWM_Start(pwm_timer, pwm_channel);
////}
////void PWM_Stop() {
////	HAL_TIM_PWM_Stop(pwm_timer, pwm_channel);
////}
////
////void PWM_Change_Tone(uint16_t pwm_freq, uint16_t volume) //(1-20000), (0-1000)
////{
////	if (pwm_freq == 0 || pwm_freq > 20000)
////		__HAL_TIM_SET_COMPARE(pwm_timer, pwm_channel, 0);
////	else {
////		const uint32_t internal_clock_freq = HAL_RCC_GetSysClockFreq();
////
////		const uint16_t prescaler = 1 + internal_clock_freq / pwm_freq / 60000;
////		const uint32_t timer_clock = internal_clock_freq / prescaler;
////		const uint32_t period_cycles = timer_clock / pwm_freq;
////		const uint32_t puls_width = volume * period_cycles / 1000 / 2;
////
////		pwm_timer->Instance->PSC = prescaler - 1;
////		pwm_timer->Instance->ARR = period_cycles - 1;
////		pwm_timer->Instance->EGR = TIM_EGR_UG;
////		__HAL_TIM_SET_COMPARE(pwm_timer, pwm_channel, puls_width);
////	}
////}
//PWM END

//UART BEGIN

void extractNumber(const uint8_t *data) {
	isCorrect = -1;
	// Extract the first four characters and convert them to integers
	char pass[19] = "PASS_CHANGED(XXXX)\n";
	pass[13] = data[9];
	pass[14] = data[10];
	pass[15] = data[11];
	pass[16] = data[12];

	for (int i = 9; i < 13; i++) {
		if (data[i] <= '9' && data[i] >= '0') {
			password[i - 9] = data[i] - '0';
		} else {
			if (logStatus) {
				HAL_UART_Transmit_IT(&huart1, "ERROR(INCORRECT FORMAT)\n", 24);
			}
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, 0);
			buzzer_flag = WrongInput;
			buzzerEnterTime = HAL_GetTick();
			if (alertStatus)
				PWM_Start();
			return;
		}
	}
	if (logStatus) {
		HAL_UART_Transmit_IT(&huart1, pass, 19);
		buzzer_flag = CorrectInput;
		buzzerEnterTime = HAL_GetTick();
		if (alertStatus)
			PWM_Start();
	}
}

int compareStrings(const char *str1, const uint8_t *str2, int n) {
	for (int i = 0; i < n; i++) {
		if (str1[i] != str2[i]) {
			return 0;
		}
	}
	return 1;
}

char setPass[9] = "SET_PASS(";
char logON[6] = "LOG_ON";
char logOFF[7] = "LOG_OFF";
char alertON[8] = "ALERT_ON";
char alertOFF[9] = "ALERT_OFF";
char setVolume[11] = "SET_VOLUME(";

uint8_t data[100];
uint8_t d;
uint8_t i;

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	if (huart->Instance == USART1) {
		HAL_UART_Receive_IT(&huart1, &d, 1);
		data[i++] = d;
		if (d == '\n') {
			if ((i == 15 && compareStrings(setPass, data, 9) == 1)
					&& isCorrect == -1) {
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, 1);
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, 0);
				extractNumber(data);
			} else if (i == 7) {
				if (compareStrings(logON, data, 6) == 1) {
					logStatus = 1;
					HAL_UART_Transmit_IT(&huart1, "Program Log Turned ON\n",
							22);
				}
			} else if (i == 8) {
				if (compareStrings(logOFF, data, 7) == 1) {
					logStatus = 0;
					HAL_UART_Transmit_IT(&huart1, "Program Log Turned OFF\n",
							23);
				}
			} else if (i == 9) {
				if (compareStrings(alertON, data, 8) == 1) {
					alertStatus = 1;
					HAL_UART_Transmit_IT(&huart1, "Program Alerts Turned ON\n",
							25);
					buzzer_flag = CorrectInput;
					buzzerEnterTime = HAL_GetTick();
					PWM_Start();
				}
			} else if (i == 10) {
				if (compareStrings(alertOFF, data, 9) == 1) {
					alertStatus = 0;
					HAL_UART_Transmit_IT(&huart1, "Program Alerts Turned OFF\n",
							26);
				}
			} else if (i == 14 && (data[11] - '0') < 6
					&& (data[11] - '0') > -1) {
				if (compareStrings(setVolume, data, 11) == 1
						&& data[12] == ')') {
					int v = data[11] - '0';
//					_volume = v * 10;
					char massage[24] = "Program Volume Set To  \n";
					massage[22] = data[11];
					HAL_UART_Transmit_IT(&huart1, massage, 24);
				}
			} else {
				HAL_UART_Transmit_IT(&huart1, "INVALID INPUT\n", 14);
				buzzer_flag = WrongInput;
				buzzerEnterTime = HAL_GetTick();
				if (alertStatus)
					PWM_Start();
			}

			i = 0;
		}

