YasinSHV/MusicMaster-STM32/MusicMaster/Core/Src/main.c
	HAL_NVIC_SetPriority(EXTI3_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(EXTI3_IRQn);

}

/* USER CODE BEGIN 4 */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
	currentMillis = HAL_GetTick();
	if ((GPIO_Pin == GPIO_PIN_1) && LED != 4) {
		if ((currentMillis - previousMillis > DEBOUNCE_DELAY)) {
//			counterInside++;
			increase(LED);
			previousMillis = currentMillis;
		}
	} else if ((GPIO_Pin == GPIO_PIN_3)) {

		if ((currentMillis - previousMillis > DEBOUNCE_DELAY)) {
			if (nextTurn < 6)
				nextTurn++;
			if ((isCorrect == -1) && nextTurn == 6) {
				for (int i = 0; i < 4; i++) {
					carrier[i] = 0;
				    //password[i] = 0;
				}
				//HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, 0);
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, 0);
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, 0);
				LED = -1;
				nextTurn = 0;
				blink = 1;
				return;
			} else if ((isCorrect != 0 && isCorrect != 1)) {

				LED += 1;
				if (LED == 4) {
					int bool = 1;
					for (int i = 0; i < 4; i++) {
						if (password[i] != carrier[i]) {
							bool = 0;
							logFailed[4] = carrier[0] + '0';
							logFailed[5] = carrier[1] + '0';
							logFailed[6] = carrier[2] + '0';
							logFailed[7] = carrier[3] + '0';
							isCorrect = 0;
							if (logStatus)
								HAL_UART_Transmit_IT(&huart1, logFailed, 18);
							prevEnterTime = HAL_GetTick();
							wrongPassCounter++;
							if (wrongPassCounter % 3 == 0)
								buzzer_flag = SuperWrongPass;
							else
								buzzer_flag = WrongPass;
							buzzerEnterTime = HAL_GetTick();
							if (alertStatus)
								PWM_Start();
							return;
						}
					}
					if (bool) {
						logCorrect[4] = carrier[0] + '0';
						logCorrect[5] = carrier[1] + '0';
						logCorrect[6] = carrier[2] + '0';
						logCorrect[7] = carrier[3] + '0';
						isCorrect = 1;
						if (logStatus)
							HAL_UART_Transmit_IT(&huart1, logCorrect, 19);
						prevEnterTime = HAL_GetTick();
						buzzer_flag = CorrectPass;
						buzzerEnterTime = HAL_GetTick();
						if (alertStatus)
							PWM_Start();
						wrongPassCounter = 0;
						return;
					}
				}
			}
			previousMillis = currentMillis;
		}

	} else if (GPIO_Pin == GPIO_PIN_0 && isCorrect == 0) {
		blink = 0;
		isCorrect = -1;
		prevEnterTime = HAL_GetTick();
//		PWM_Stop();
		buzzer_flag = NONE;
	}
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	if (htim->Instance == TIM1) {
		if (index == LED && HAL_GetTick() - prevTime < 400) {
			display_number(index, carrier[index]);
			coolDownTimer = HAL_GetTick();
		} else if (index == LED && HAL_GetTick() - prevTime > 900) {
			//coolDown
			if (HAL_GetTick() - coolDownTimer > 100) {
				prevTime = HAL_GetTick();
			}
		} else if (index != LED) {
			display_number(index, carrier[index]);
		}
		if (index == 4) {
			index = 0;
			init_display();
		} else {
			++index;
		}

		if (isCorrect == 1 && blink == 1) {
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, 1);
			if (HAL_GetTick() - prevEnterTime > 5000) {
				blink = 0;
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, 0);
				prevEnterTime = HAL_GetTick();
				isCorrect = -1;
			}
		}

		if (isCorrect == 0 && blink == 1) {
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, 0);
			if (HAL_GetTick() - prevEnterTime < 5000) {
				if (HAL_GetTick() - prevTime > 100) {
					HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_2);
					prevTime = HAL_GetTick();
				}
			} else {
				if (buzzer_flag != SuperWrongPass) {
					blink = 0;
					isCorrect = -1;
					prevEnterTime = HAL_GetTick();
				}
			}
		}

//		switch (buzzer_flag) {
//		case CorrectInput:
//			if (buzzer_flag == CorrectInput) {
//				if (HAL_GetTick() - buzzerEnterTime < 50) {
//					PWM_Change_Tone(507, _volume);
//				} else {
//					PWM_Stop();
//					buzzer_flag = NONE;
//				}
//			}
//			break;
//		case WrongInput:
//			if (HAL_GetTick() - buzzerEnterTime < 1000) {
//				if (HAL_GetTick() - buzzerCoolDown < 50) {
//					PWM_Change_Tone(236, _volume);
//				} else if (HAL_GetTick() - buzzerCoolDown < 300) {
//					//coolDown
//					PWM_Change_Tone(0, 0);
//				} else
//					buzzerCoolDown = HAL_GetTick();
//			} else {
//				PWM_Stop();
//				buzzer_flag = NONE;
//			}
//			break;
//		case CorrectPass:
//			if (HAL_GetTick() - buzzerEnterTime < 1200) {
//				if (HAL_GetTick() - buzzerEnterTime < 800) {
//					if (HAL_GetTick() - buzzerCoolDown < 50) {
//						PWM_Change_Tone(1000, _volume);
//					} else if (HAL_GetTick() - buzzerCoolDown < 100) {
//						//coolDown
//						PWM_Change_Tone(0, _volume);
//					} else
//						buzzerCoolDown = HAL_GetTick();
//				} else {
//					PWM_Change_Tone(1000, _volume);
//				}
//			} else {
//				PWM_Stop();
//				buzzer_flag = NONE;
//			}
//			break;
//		case WrongPass:
//			if (HAL_GetTick() - buzzerEnterTime < 1500) {
//				if (HAL_GetTick() - buzzerCoolDown < 150) {
//					PWM_Change_Tone(700, _volume);
//				} else if (HAL_GetTick() - buzzerCoolDown < 450) {
//					//coolDown
//					PWM_Change_Tone(0, _volume);
//				} else
//					buzzerCoolDown = HAL_GetTick();
//			} else {
//				PWM_Stop();
//				buzzer_flag = NONE;
//			}
//			break;
//		case SuperWrongPass:
//			PWM_Change_Tone(1000, _volume);
//			break;
//		}
	}
}

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1) {
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
